; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v5)
             (pred_10 ?v9 ?v10)
             (pred_1 ?v12 ?v10)
             (pred_9 ?v2 ?v12 )
	     (pred_12 ?v12)
             (pred_4 ?v3)
             (pred_3 ?v9)
             (pred_8 ?v10)
             (pred_11 ?v12)
             (pred_5 ?v9)
             (pred_7 ?v12)
             (pred_2 ))



(:action op_2
:parameters (?v6 ?v1 ?v7 ?v4)
:precondition (and (pred_4 ?v6) (pred_4 ?v1) (pred_3 ?v7) (pred_8 ?v4)
          (pred_6 ?v6 ?v1) (pred_10 ?v7 ?v4)
                   (pred_1 ?v1 ?v4) (pred_12 ?v6) 
                   (pred_11 ?v1) (pred_5 ?v7))
:effect (and  (pred_7 ?v1) (not (pred_11 ?v1))))


(:action op_3
:parameters (?v6 ?v8)
:precondition (and (pred_4 ?v6) (pred_4 ?v8)
               (pred_12 ?v6) (pred_6 ?v6 ?v8) (pred_7 ?v8))
:effect (and (pred_12 ?v8) (not (pred_12 ?v6))))

(:action op_5
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_3 ?v7) 
                  (pred_12 ?v6) (pred_9 ?v7 ?v6) (pred_2 ))
:effect (and (pred_5 ?v7)
   (not (pred_9 ?v7 ?v6)) (not (pred_2 ))))


(:action op_4
:parameters (?v6 ?v11 ?v13)
:precondition (and (pred_4 ?v6) (pred_3 ?v11) (pred_3 ?v13)
                  (pred_12 ?v6) (pred_5 ?v13) (pred_9 ?v11 ?v6))
:effect (and (pred_5 ?v11) (pred_9 ?v13 ?v6)
        (not (pred_5 ?v13)) (not (pred_9 ?v11 ?v6))))

(:action op_1
:parameters (?v6 ?v7)
:precondition (and (pred_4 ?v6) (pred_3 ?v7) 
                  (pred_12 ?v6) (pred_5 ?v7))
:effect (and (pred_2 ) (pred_9 ?v7 ?v6) (not (pred_5 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_16 obj_14 obj_09 obj_19 obj_13 obj_03 obj_10 obj_08 obj_06 obj_20 obj_17 obj_18 obj_07 obj_04
    obj_02 obj_12
    obj_01 obj_05
    )

    (:init
       (pred_2)

       (pred_4 obj_11)
       (pred_4 obj_15)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_09)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_03)
       (pred_4 obj_10)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_07)
       (pred_4 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_12)
       (pred_3 obj_01)
       (pred_3 obj_05)

       (pred_6 obj_11 obj_09)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_16)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_16 obj_13)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_15)
       (pred_6 obj_14 obj_03)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_09 obj_10)
       (pred_6 obj_09 obj_19)
       (pred_6 obj_09 obj_11)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_09)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_03)
       (pred_6 obj_13 obj_16)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_03 obj_14)
       (pred_6 obj_03 obj_13)
       (pred_6 obj_10 obj_17)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_09)
       (pred_6 obj_08 obj_18)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_20 obj_04)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_10)
       (pred_6 obj_18 obj_07)
       (pred_6 obj_18 obj_08)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_07 obj_04)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_18)
       (pred_6 obj_04 obj_20)
       (pred_6 obj_04 obj_07)
       (pred_11 obj_08)
       (pred_11 obj_16)
       (pred_1  obj_08 obj_02)
       (pred_1  obj_16 obj_12)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_14)
       (pred_7 obj_09)
       (pred_7 obj_19)
       (pred_7 obj_13)
       (pred_7 obj_03)
       (pred_7 obj_10)
       (pred_7 obj_06)
       (pred_7 obj_20)
       (pred_7 obj_17)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_7 obj_04)

       (pred_10  obj_01 obj_02)
       (pred_10  obj_05 obj_12)
       (pred_9 obj_01 obj_13)
       (pred_9 obj_05 obj_11)
       (pred_12 obj_11)
    )

    (:goal (and
       (pred_9 obj_01 obj_11)
       (pred_9 obj_05 obj_17)
    ))
(:constraints
  (always (not (pred_12 obj_09)))
)
)

; plan
1. (op_3 obj_11 obj_15)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_15)
   goals met: 0 of 2
2. (op_3 obj_15 obj_19)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_19)
   goals met: 0 of 2
3. (op_3 obj_19 obj_13)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_13)
   goals met: 0 of 2
4. (op_5 obj_13 obj_01)
   deleted: (pred_9 obj_01 obj_13) (pred_2)
   added: (pred_5 obj_01)
   goals met: 0 of 2
5. (op_3 obj_13 obj_19)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_19)
   goals met: 0 of 2
6. (op_3 obj_19 obj_15)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_15)
   goals met: 0 of 2
7. (op_3 obj_15 obj_11)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_11)
   goals met: 0 of 2
8. (op_4 obj_11 obj_05 obj_01)
   deleted: (pred_5 obj_01) (pred_9 obj_05 obj_11)
   added: (pred_5 obj_05) (pred_9 obj_01 obj_11)
   goals met: 1 of 2
9. (op_3 obj_11 obj_15)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_15)
   goals met: 1 of 2
10. (op_3 obj_15 obj_19)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_19)
   goals met: 1 of 2
11. (op_3 obj_19 obj_13)
   deleted: (pred_12 obj_19)
   added: (pred_12 obj_13)
   goals met: 1 of 2
12. (op_3 obj_13 obj_06)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_06)
   goals met: 1 of 2
13. (op_3 obj_06 obj_07)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_07)
   goals met: 1 of 2
14. (op_3 obj_07 obj_18)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_18)
   goals met: 1 of 2
15. (op_3 obj_18 obj_17)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_17)
   goals met: 1 of 2
16. (op_1 obj_17 obj_05)
   deleted: (pred_5 obj_05)
   added: (pred_2) (pred_9 obj_05 obj_17)
   goals met: 2 of 2
